nxp-mcuxpresso/mcux-soc-svd/MCXN247/MCXN247.xml
        <register>
          <name>PE2</name>
          <description>Pin Enable 2</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUPE16</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE17</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE18</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE19</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE20</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE21</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE22</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE23</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE24</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE25</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE26</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE27</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE28</name>
              <description>Wake-up Pin Enable for WUU_Pn</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_RISE_HI</name>
                  <description>Enable (detect on rising edge or high level)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_FALL_LO</name>
                  <description>Enable (detect on falling edge or low level)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_ANY</name>
                  <description>Enable (detect on any edge)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ME</name>
          <description>Module Interrupt Enable</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUME0</name>
              <description>Module Interrupt Wake-up Enable for Module 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUME1</name>
              <description>Module Interrupt Wake-up Enable for Module 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUME2</name>
              <description>Module Interrupt Wake-up Enable for Module 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUME3</name>
              <description>Module Interrupt Wake-up Enable for Module 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUME4</name>
              <description>Module Interrupt Wake-up Enable for Module 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUME5</name>
              <description>Module Interrupt Wake-up Enable for Module 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUME6</name>
              <description>Module Interrupt Wake-up Enable for Module 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUME7</name>
              <description>Module Interrupt Wake-up Enable for Module 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUME8</name>
              <description>Module Interrupt Wake-up Enable for Module 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUME9</name>
              <description>Module Interrupt Wake-up Enable for Module 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
